Notas-de-clase/clase-2022-08-17.md

# &Iacute;ndice

1.  [Autoboxing](#org9252b50)
    1.  [Diferencia entre null y 0](#org875bf46)
2.  [Constantes](#org9c65968)
3.  [Literales expresados en otro sistema numérico](#org85048e4)
4.  [Carácteres especiales](#orgd668ed1)
5.  [Type Casting](#org4f58dc9)
    1.  [Type Casting automático](#org6b352f8)
    2.  [Type Casting manual](#org8aa2754)
6.  [Operadores](#orgc668ee8)
    1.  [Operadores Aritméticos](#org06c7f82)



<a id="org9252b50"></a>

# Autoboxing

La conversión entre tipo de dato primitivo y su correspondiente wrapper es automática. Esta característica se le denomina autoboxing.

    Integer value = new Integer(value: 1234);
    int valuePrimitive = value;

El constructor de integer esta obsoleto a partir de la versión 9 de Java y podemos inicializar escribiendo el valor literal.

    Integer value = new Integer(value: 1234); // Deprecado
    Integer value2 = 1234;                    // Actual

En reglas generales, para declarar variables utilizaremos los tipos primitivos y utilizaremos los wrappers para utilizar operaciones vinculados a estos, sin embargo los wrappers al ser objetos, pueden contener el valor *null*, lo cual nos podría servir de utilidad.

    Integer optionalValue = null;
    if (optionalValue != null) {
        System.out.println(optionalValue);
    } else {
        System.out.println("El objeto se encuentra nulo");
    }


<a id="org875bf46"></a>

## Diferencia entre null y 0

Semánticamente, null y 0 significan cosas diferentes.


<a id="org9c65968"></a>

# Constantes

Para declarar un valor constante utilizaremos el modificador final

    final double pi = 3.1416;
    pi = 3.141612; // error: no se puede sobreescribir constante

Es posible inicializar una variable después de su declaración, pero no se considera buena práctica

    final int value = 10; // Correcto y recomendado
    final int value2;
    value2 = 20; // correcto, pero no recomendado

Generalmente se suele ver a las constantes acompañadas con public y static de manera global en las clases.


<a id="org85048e4"></a>

# Literales expresados en otro sistema numérico

Anteponemos el prefijo 0b un valor literal numérico entero mediante su representación en sistema binario. Opcionalmente ponemos el carácter \_ para apoyarnos a separar el número.

    int binary = 0b00000202_00111001_01111111_10110001;

Para hexadecimal se usa el prefijo 0x.


<a id="orgd668ed1"></a>

# Carácteres especiales

Los caractéres especiales podemos utilizarlos dentro de una cadena anteponiéndoles el caractér de escape.

<!-- This HTML table template is generated by emacs 28.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;Caractér&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Descripción&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Salto&nbsp;de&nbsp;linea&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\b&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Retorno&nbsp;de&nbsp;carro&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\t&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;tabulador&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;comilla&nbsp;doble&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\\&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;diagonal&nbsp;inversa&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;\udddd&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;cualquier&nbsp;carácter&nbsp;expresado&nbsp;<br />
      &nbsp;mediante&nbsp;su&nbsp;código&nbsp;unicode&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>


<a id="org4f58dc9"></a>

# Type Casting

El type casting es la conversión de un tiṕpo de dato a otro. En java existen dos tipos de Type Casting.


<a id="org6b352f8"></a>

## Type Casting automático

El type casting automático se da cuando se quiere convertir de un tipo de dato más pequeño a uno más grande.

byte->short->char->int->long->float->double.

    int value = 15;
    double valueDecimal = value;


<a id="org8aa2754"></a>

## Type Casting manual

En el type casting Manual debe de colocarse el tipo de entre paréntesis antes del valor.

    double valueDecimal = 15.0;
    int value = (int) valueDecimal;


<a id="orgc668ee8"></a>

# Operadores

Los operadores se utilizan para realizar operaciones con variables y constantes.

Existen grupos de operadores para poder identificarlos de mejor manera, son los siguientes:

-   Operadores aritméticos
-   Operadores de asignación
-   Operadores de comparación
-   Operadores lógicos


<a id="org06c7f82"></a>

## Operadores Aritméticos

Se utilizan para realizar operaciones matemáticas comunes.

<!-- This HTML table template is generated by emacs 28.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;Operador&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Nombre&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Ejemplo&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Suma&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x&nbsp;+&nbsp;y&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Resta&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x&nbsp;-&nbsp;y&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Multiplicación&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x&nbsp;*&nbsp;y&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;/&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;División&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x/y&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Módulo&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x%y&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;++&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Incremento&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;++x&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;--&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Decremento&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;--x&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

